import requests

url = "http://127.0.0.1:8000/api/v1/get_contents_and_theses"
payload = {"text": """Пандемія COVID-19 змусила освітні установи у всьому світі перейти на дистанційне навчання. Це дослідження спрямоване на вивчення впливу онлайн-освіти на рівень знань і академічну мотивацію студентів.

У дослідженні взяли участь 850 студентів з 10 українських вишів. За основу взято змішану методологію: анкетування та інтерв’ю з викладачами й студентами.

Результати показали, що 63% студентів вважають рівень засвоєння матеріалу нижчим під час онлайн-занять, порівняно з традиційним навчанням. Серед основних причин — низька залученість, технічні труднощі та нестача живої взаємодії.

Проте 25% опитаних відзначили позитивні аспекти, "як-от" гнучкість графіка та можливість переглядати лекції в записі.

У висновках автори рекомендують поєднувати елементи онлайн- і офлайн-навчання після завершення пандемії, а також посилити цифрову підготовку викладачів."""}
response = requests.post(url, json=payload)
print(response.json())